Revit 2027 API
MEPSystem.IsValid Property
 Indicates if the system is valid or not. atom AtomValidateSystem default false
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
public:
property bool IsValid {
	bool get ();
}
member IsValid : bool with get
Property Value
Boolean
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace